fonecmid-diplom/src/Documents/ВКМ_УстановкаОкладов/ВКМ_УстановкаОкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_УстановкаОкладов</name>
  <registerRecords>InformationRegister.ВКМ_УсловияОплатыСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВКМ_КатегорияСотрудника/ВКМ_КатегорияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорияСотрудника</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>Управленец</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_УстановкаОкладов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Сотрудники.Количество() = 0 Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Отмена проведения! Табличная часть документа пуста.");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УстановкаОкладовСотрудники.Сотрудник КАК Сотрудник,
	|	ВКМ_УстановкаОкладовСотрудники.Сотрудник.КатегорияСотрудника КАК КатегорияСотрудника,
	|	ВКМ_УстановкаОкладовСотрудники.Оклад,
	|	ВКМ_УстановкаОкладовСотрудники.Процент
	|ИЗ
	|	Документ.ВКМ_УстановкаОкладов.Сотрудники КАК ВКМ_УстановкаОкладовСотрудники
	|ГДЕ
	|	ВКМ_УстановкаОкладовСотрудники.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	// регистр ВКМ_УсловияОплатыСотрудников
	Движения.ВКМ_УсловияОплатыСотрудников.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Оклад = Выборка.Оклад;
		Если Выборка.КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.Специалист Тогда
		     Движение.ПроцентОтРабот = ВЫборка.Процент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры
#КонецОбласти



#КонецЕсли
